
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.АктивныеПосещения.Записывать = Истина;	
	Движения.АктивныеПосещения.Записать();
			
	Движения.Продажи.Записывать = Истина;		
	
	// регистр АктивныеПосещения
	Движение = Движения.АктивныеПосещения.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.Основание = Ссылка;
	Движение.Аттракцион = Аттракцион;
	Движение.КоличествоПосещений = 1;


	// регистр Продажи
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата;
	Движение.Аттракцион = Аттракцион;
	Движение.Сумма = СуммаДокумента;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
